
Процедура НеПроводитьПоУпрУчетуПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Контрагент = Источник.Контрагент;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СобственныеКонтрагенты.Контрагент
	               |ИЗ
	               |	РегистрСведений.СобственныеКонтрагенты КАК СобственныеКонтрагенты
	               |ГДЕ
	               |	СобственныеКонтрагенты.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Результат = Запрос.Выполнить();
	
	Если не Результат.Пустой() Тогда
		
		Сообщить(" --- Выполняется сделка с собственным контрагентом. Флаг Управленческого учета будет снят ---");
		Источник.ОтражатьВУправленческомУчете = Ложь;
		
	КонецЕсли;
		
КонецПроцедуры
