&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресСпискаАлкогольнойПродукции = "";
	Параметры.Свойство("АдресСпискаАлкогольнойПродукции", АдресСпискаАлкогольнойПродукции);
	
	МассивЭлементов = ПолучитьИзВременногоХранилища(АдресСпискаАлкогольнойПродукции);
	Если ТипЗнч(МассивЭлементов) <> Тип("Массив") Тогда
		ВызватьИсключение НСтр("ru = 'В форму создания номенклатуры переданы некорректные параметры.'");
	КонецЕсли;
	
	СоответствиеНоменклатуры = ПолучитьСоответствиеНоменклатуры(МассивЭлементов);
	
	Для каждого АлкогольнаяПродукция Из МассивЭлементов Цикл
	
		Если СоответствиеНоменклатуры.Получить(АлкогольнаяПродукция) = Неопределено Тогда
			СписокАлкогольнойПродукции.Добавить(АлкогольнаяПродукция);
		КонецЕсли;
	
	КонецЦикла;
	
	Если СписокАлкогольнойПродукции.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаголовокКоманды = НСтр("ru = 'Создать номенклатуру (%КоличествоЭлементов%)'");
	Элементы.ФормаСоздатьНоменклатуру.Заголовок = СтрЗаменить(ЗаголовокКоманды, "%КоличествоЭлементов%", СписокАлкогольнойПродукции.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСозданияНоменклатуры = Новый Структура;
	ПараметрыСозданияНоменклатуры.Вставить("Родитель"            , Родитель);
	ПараметрыСозданияНоменклатуры.Вставить("ВидНоменклатуры"     , ВидНоменклатуры);
	ПараметрыСозданияНоменклатуры.Вставить("ЕдиницаИзмерения"    , ЕдиницаИзмерения);
	ПараметрыСозданияНоменклатуры.Вставить("СтавкаНДС"           , СтавкаНДС);
	ПараметрыСозданияНоменклатуры.Вставить("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	ПараметрыСозданияНоменклатуры.Вставить("СтранаПроисхождения" , СтранаПроисхождения);
	ПараметрыСозданияНоменклатуры.Вставить("МассивЭлементов"     , СписокАлкогольнойПродукции.ВыгрузитьЗначения());
	
	Закрыть(ПараметрыСозданияНоменклатуры);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСоответствиеНоменклатуры(МассивАлкогольнойПродукции)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивАлкогольнойПродукции", МассивАлкогольнойПродукции);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция,
	|	СоответствиеНоменклатурыЕГАИС.Номенклатура
	|ИЗ
	|	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	|ГДЕ
	|	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция В(&МассивАлкогольнойПродукции)";
	
	СоответствиеНоменклатуры = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеНоменклатуры.Вставить(Выборка.АлкогольнаяПродукция, Выборка.Номенклатура);
	КонецЦикла;
	
	Возврат СоответствиеНоменклатуры;
	
КонецФункции
